#include <stdio.h>
#include <conio.h>

void main()
{
    int x = 1, y = 0, z = 2; 
    int a = 0;

    z = ((a = x++) * y == 0 || a < 0 && z);
    // Спочатку виконується присвоєння a = x++. Змінна a отримує значення 1, а потім змінна x збільшується на 1.
    // Далі обчислюється вираз (a * y == 0). a має значення 1, y має значення 0, тому цей вираз буде true (1 * 0 == 0).
    // Оскільки перше вираження вже є true, другий вираз у виразі || (a < 0 && z) не обчислюється через коротке зчленення (short-circuiting).
    // Так як обидва вирази у виразі || є true, всього вираз буде true.
    // Змінна z отримає значення true, тобто 1.

    printf("z=%d\n", z);

    getch(); 
}
