#include <stdio.h>
#include <conio.h> // Попередження: <conio.h> це бібліотека, яка зазвичай використовується в DOS-подібних оточеннях, але в деяких середовищах може викликати проблеми. Найкраще замінити її, якщо ви пишете код для сучасних операційних систем.

void main()
{
    int a = 0, b = 3, c;
    c = b % 2 || (a >= 0) && (++b / 2 * a) == 0;
    // Оператори || та && мають різні пріоритети. || має менший пріоритет, тому його виконають пізніше.
    // Оператор b % 2 поверне 1, оскільки 3 ділиться на 2 з залишком. Тому результат цілого виразу (b % 2 || (a >= 0) && (++b / 2 * a) == 0) буде 1.
    // Зверніть увагу, що (++b / 2 * a) не виконається, оскільки оператор || має коротке зчленення (short-circuiting): якщо перше вираження b % 2 вже є true, друге вираження не обчислюється.
    // Таким чином, c отримає значення true, або 1.

    printf("a=%d, c=%d\n", a, c); // Виведе "a=0, c=1", оскільки a залишається 0, а c отримує значення true (або 1).

    getch(); // Очікуємо натискання клавіші користувачем перед завершенням програми. У модернізованих середовищах рекомендується використовувати функцію getchar() замість getch().
}
