#include <stdio.h>
#include <conio.h>

void main()
{
    int a = 1, b = 0, c;
    c = b * 2 || (a >= 0) && (++b * a) == 0;
    // Оператор * виконує множення b на 2
    // Після цього вираз || оцінюється
    // Другий вираз (a >= 0) && (++b * a) == 0 також оцінюється. a має значення 1, яке більше або дорівнює 0, тому ця частина виразу true
    // Таким чином, програма не виконає збільшення b та множення на a
    // Так як одне з виразів у виразі || є true, весь вираз буде вважатися true
    // Отже, змінна c отримає значення true, що в C інтерпретується як 1

    printf("c=%d\n", c); // Виведе c

    getch(); // Чекаємо натискання клавіші користувачем перед завершенням програми
}
