#include <stdio.h>
#include <conio.h>

void main()
{
    int x = 1, y = -2, z;
    z = (x / 2 * 7 != 0) && (y < 0) || (y % 2 == 0);
    // Спочатку виконається ділення, а потім множення
    // x / 2 дорівнює 0 (цілочисельне ділення), а потім 0 множиться на 7
    // Отже, вираз (x / 2 * 7 != 0) буде false (0).
    // Потім обчислюється другий вираз (y < 0). y має значення -2, тому цей вираз буде true
    // Третій вираз (y % 2 == 0) також буде false, оскільки -2 не ділиться націло на 2.
    // Тепер, у виразі (false && true || false), який означає (0 && 1 || 0), перший оператор && виконується, оскільки один з виразів - false.
    // Результат (0 || 0) дорівнює 0.
    // Змінна z отримає значення false, тобто 0.

    printf("z=%d\n", -z); 

    getch(); 
}
