#include <stdio.h>
#include <conio.h>

void main()
{
    int x = 1, z, b = 0, y = 2;
    z = (x + 1 > y == 0) || b++ || (x * y % 3 == 0);
    // Спочатку обчислюється вираз (x + 1 > y == 0). x + 1 = 2, а y = 2, тому цей вираз буде false (0 == 0).
    // Потім обчислюється вираз b++, але через коротке зчленення (short-circuiting), якщо перший вираз (x + 1 > y == 0) вже є true, цей вираз не обчислюється.
    // Таким чином, змінна b не змінюється.
    // Нарешті, обчислюється останній вираз (x * y % 3 == 0). x * y = 1 * 2 = 2, а 2 % 3 != 0, тому цей вираз буде false.
    // Оскільки хоча б один із виразів у виразі || є true, весь вираз буде true.
    // Змінна z отримає значення true, тобто 1.

    printf("Z= %d\n", z); // Отже, виведе "Z= 1".

    getch(); // Чекаємо натискання клавіші користувачем перед завершенням програми. У сучасних середовищах рекомендується використовувати функцію getchar() замість getch().
}
