#include <stdio.h>
#include <conio.h>

void main()
{
    int x = 2, z, y = 0;
    z = (x == 0) && (y == 1) || (y > 0);
    // Спочатку обчислюється перший вираз (x == 0), але x має значення 2, тому цей вираз буде false.
    // Далі обчислюється другий вираз (y == 1), але y має значення 0, тому цей вираз теж буде false.
    // Так як обидва вирази у виразі && є false, всього вираз буде false.
    // Зверніть увагу, що через коротке зчленення (short-circuiting) третій вираз (y > 0) не обчислюється.
    // Отже, змінна z отримає значення false, тобто 0.

    printf("z=%d\n", z); 

    getch(); 
}
